package com.mohammedsalah.learnhowtolearn;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.app.AlertDialog;
import android.content.DialogInterface;
import android.content.Intent;
import android.content.SharedPreferences;
import android.os.Bundle;
import android.os.CountDownTimer;
import android.view.View;
import android.view.WindowManager;
import android.widget.TextView;
import android.widget.Toast;

import com.bumptech.glide.Glide;
import com.bumptech.glide.request.RequestOptions;
import com.google.android.gms.ads.MobileAds;
import com.google.android.gms.tasks.OnCompleteListener;
import com.google.android.gms.tasks.OnFailureListener;
import com.google.android.gms.tasks.OnSuccessListener;
import com.google.android.gms.tasks.Task;
import com.google.firebase.auth.FirebaseAuth;
import com.google.firebase.auth.FirebaseUser;
import com.google.firebase.firestore.DocumentSnapshot;
import com.google.firebase.firestore.EventListener;
import com.google.firebase.firestore.FirebaseFirestore;
import com.google.firebase.firestore.FirebaseFirestoreException;
import com.google.firebase.firestore.QuerySnapshot;

import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Calendar;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import de.hdodenhof.circleimageview.CircleImageView;

public class category extends AppCompatActivity {
    RecyclerView recyclerView;
    categ_adapter adapter;
    GridLayoutManager gridLayoutManager;
    List<category_class> list = new ArrayList<>();
    FirebaseFirestore firebaseFirestore;
    FirebaseAuth firebaseAuth;
    private String user_id;
    CircleImageView imageView;
    TextView name;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_category);

        getWindow().setFlags(WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS, WindowManager.LayoutParams.FLAG_LAYOUT_NO_LIMITS);

        imageView = findViewById(R.id.user_photo);
        name = findViewById(R.id.user_name);

        imageView.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent intent = new Intent(getApplicationContext(), upload_user_image.class);
                startActivity(intent);
            }
        });

        name.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent intent = new Intent(getApplicationContext(), upload_user_image.class);
                startActivity(intent);
            }
        });

        firebaseFirestore = FirebaseFirestore.getInstance();
        firebaseAuth = FirebaseAuth.getInstance();


        TextView text_id = findViewById(R.id.user_id);
        final TextView text_name = findViewById(R.id.user_name);
        final CircleImageView imageview = findViewById(R.id.user_photo);

        if (firebaseAuth.getCurrentUser() != null) {
            user_id = firebaseAuth.getCurrentUser().getUid(); // get current user id

            firebaseFirestore.collection("users").document(user_id).get().addOnCompleteListener(new OnCompleteListener<DocumentSnapshot>() {
                @Override
                public void onComplete(@NonNull Task<DocumentSnapshot> task) {
                    if (task.isSuccessful()) {
                        // check if data is exist
                        if (task.getResult().exists()) {
                            // get data from data base
                            String image = task.getResult().getString("image");
                            String nameText = task.getResult().getString("name");

                            text_name.setText(nameText);
                            // to get images we should use Glide library or Picasso
                            RequestOptions requestOptions = new RequestOptions();
                            Glide.with(getApplicationContext()).setDefaultRequestOptions(requestOptions).load(image).into(imageview);

                        }
                    }
                }
            });
        }


        // check intertnt connection
        InterntConections connectionInternet = new InterntConections(this);
        Boolean c = connectionInternet.IsConnectToInternt();
        if (!c) {
            text_id.setText("offline");
            final AlertDialog.Builder alert = new AlertDialog.Builder(this);
            alert.setMessage("\" No Internet Connection \"");
            alert.setTitle("Network Error!");
            alert.setPositiveButton("ok", new DialogInterface.OnClickListener() {
                @Override
                public void onClick(DialogInterface dialog, int which) {
                    alert.setCancelable(true);
                }
            });
            alert.create();
            alert.show();
        } else text_id.setText("online");


        list.add(new category_class("android", R.mipmap.android, "Android",
                "",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/android.jpg?alt=media&token=8a110791-d5f0-4bed-a731-454a01f3b120"));

        list.add(new category_class("flutter", R.mipmap.flutter, "Flutter", "فلاتر :-\n" +
                " هو SDK من شركة جوجل مخصص لبرمجة تطبيقات الهواتف الذكية العاملة بنظام الاندرويد وال IOS و فوشيا (نظام تشغيل جديد من جوجل) وايضا بدا يتطور ليصبح قادر علي تطوير الويب , حيث يركز على تجربة المستخدم و المطور في نفس الوقت و هذا لأنه يوفر إطار عمل شامل بلغة دارت مخصص لرسم الوجهات بجودة عالية و تطبيقات أصلية بأداء ممتاز و في نفس الوقت يعطي للمطور الأدوات التي تجعله يبني تطبيقات كاملة في أقل وقت , هل فلاتر ينافس باقية المنافسين ؟طبعا سوق برمجة تطبيقات الهواتف الذكية حجمه كبير جدا و في الفترة الاخيرة ظهرت حلول تمكننا من عمل تطبيقات لكلا النظامين المشهورين الأندرويد وال IOS بالاضافة الى الويب و سطح المكتبة و الاجهزة المدمجة في نفس الوقت و تلك الحلول تختلف تقنيا و في هذا الجدول ساوضح لكم الاختلافات المهمة بين أكبر أربع منافسين الآن في سوق تطوير تطبيقات الهواتف الذكية و بلغة واحدة (لن تشمل المقارنة الأدوات الاصلية أي الجافا و الكوتلين للاندرويد و السويفت و السي الكائنية للـ IOS)\n" +
                "المنافسة ستكون بين ريكات ناتيف و زامرن و ايونيك و فلاتر لكن يجب التنبيه إلى :\n" +
                "ريكات ناتيف : يمثل أيضا الحلول الاخرى مثل ناتيف سكربت.\n" +
                "زامرن : نتحدث عن زامرن فورمز لأنه الطريقة الصحيحة لكتابة مرة واحدة و نشر في كل مكان وهذا من أهم عوامل المقارنة.\n" +
                "ايونيك : ممثلا لكل الحلول الهجينة المعروفة مثل كوردوفا و فون غاب.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/flutter.jpg?alt=media&token=a5012c68-375e-4ccc-9df6-793644ca3d73"));
        list.add(new category_class("back_end", R.mipmap.backend, "BackEnd",
                "Back end Development فيعني تطوير وصيانة البنية التحتية  او الاساس للتطبيق، وأيضا تصميم وتعديل قواعد البيانات الخاصة بالتعامل مع هذا التطبيق . وبالطبع فإن برمجة المواقع تتطلب بناء البنية التحتية أو أساس الموقع أولا، ثم تأتي برمجة الواجهة Front end development كخطوة ثانية.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/back%20end.jpg?alt=media&token=0347e2b4-88d2-460b-b4da-6c76a07a20b1"));
        list.add(new category_class("front_end", R.mipmap.front, "FrontEnd",
                "Front end Development هو  الخاص بتطوير كل ما يتعلق بالواجهة الامامية للتطبيقات ومظهرها ، أي كل ما يشاهده المستخدم  ويؤاه بعينه من واجهات واشكال وبنارات  وايقونات وخطوط وصور ونصوص ، وغيرها.  هو الجزء من الموقع الذي يتفاعل معه المستخدمين، " +
                        "أي شيء من مكونات الموقع التي يمكنك مشاهدتها، مثل الـ Buttons والـ Dropdowns menu والخطوط والألوان ومعارض الصور وحركات ال Animation وغيرها .. من الأمور التي يراها المستخدم ويتفاعل معها.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/front%20end.jpg?alt=media&token=6cc5f524-7131-425a-8bc1-390a8020c353"));
        list.add(new category_class("computerenginnering", R.mipmap.computerenginner, "CE", "هندسة الحاسوب هندسة الكمبيوتر أو هندسة الحاسوب (بالإنجليزيّة: Computer Engineering) هي إحدى فروع الهندسة الإلكترونيّة، وتتخصَّص بشكلٍ عام في ثلاث مجالات هي: عتاد أجهزة الحاسوب، وبرمجيّات أجهزة الحاسوب، وتطبيقات برمجيّات الحاسوب. ويقوم مهندسو الحاسوب بتصميم الحواسيب وبرمجيّاتها، ومن ثُمَّ يُشرفون على هذه التصاميم من لحظة التخطيط لها وحتّى الانتهاء من بنائها. إنَّ مهندس الحاسوب الناجح لا بد له أن يجمع ما بين التعليم، والمهارات الشخصيّة أثناء عمله. وعادةً ما يعمل مهندسو الحاسوب في مختبرات الأبحاث، والتي تُعنى بتصميم واختبار مُختَلَف أنواع أجهزة الحاسوب.[١][٢][٣] مجالات عمل هندسة الحاسوب يعمل مهندسو الحاسوب في مجاليّ العتاد الصلب للحاسوب، وبرمجيّات الحاسوب. ويختلف العمل في المجالين على النحو الآتي: العاملون في مجال العتاد الصلب يقوم العاملون في مجال العتاد الصلب بإعداد الأبحاث، بالإضافة إلى تصميم هذا العتاد وتطويره، واختبار صحّته وجودته، وكلّ ذلك يتطلَّب توفُّر مهارة جيّدة في مجال الهندسة الكهربائيّة. ومن الأمثلة على أنواع العتاد التي يختصّ بها مهندسو الحاسوب ما يلي:[١][٤] المعالجات الدقيقة (بالإنجليزيّة: Microprocessors). ذاكرة الأجهزة الحاسوبيّة: والتي منها ذاكرة الوصول العشوائي (بالإنجليزيّة: RAM)، بالإضافة إلى ذاكرة القراءة فقط (بالإنجليزيّة: ROM)، والذاكرة الوميضيّة (بالإنجليزيّة: Flash Memory) القابلة لإعادة الكتابة. أجهزة تخزين البيانات: كالأقراص الصلبة (بالإنجليزيّة: Hard Disks)، ووسائط التخزين ذات الحالة الثابتة (بالإنجليزيّة: SSDs)، والأقراص الضوئيّة (بالإنجليزيّة: Optical Drives). أجهزة الإدخال: والتي منها لوحة المفاتيح (بالإنجليزيّة: Keyboard)، والفأرة، وآلة التصوير، والميكروفون، وشاشة اللّمس، وذراع التوجيه (بالإنجليزيّة: Joystick)، والماسحة (بالإنجليزيّة: Scanners)، وغير ذلك. أجهزة الإخراج: كالشاشات، وأجهزة الصوت (كالسمّاعات)، وأجهزة التحكُّم عن بُعد، والطابعات، وغيرها. معدّات الشبكة: كأجهزة المودم، والموجّهات (بالإنجليزيّة: Routers)، والمُبدِّلات (بالإنجليزيّة: Switches). العاملون في مجال برمجيّات الحاسوب يتخصّص مهندسو الحاسوب العاملون في مجال برمجيّات الحاسوب في العديد من أنواع البرامج والتطبيقات، والتي منها ما يأتي:[١] أنظمة التشغيل (بالإنجليزيّة: Operating Systems). التطبيقات: كبرامج معالجة الكلمات (بالإنجليزيّة: Word Processors)، وبرامج الجداول الممتدّة (بالإنجليزيّة: Spreadsheet)، وبرامج التّصميم بمساعدة الحاسوب (بالإنجليزيّة: CADs)، بالإضافة إلى إدارة قواعد البيانات، والرسومات (بالإنجليزيّة: Graphics)، ومقاطع الصوت والصورة، والألعاب، وغير ذلك. برمجيّات الشبكات والاتصالات: كتلك المستخدمة في الشبكة العنكبوتيّة (الإنترنت)، وأنظمة الصوت عبر الإنترنت (بالإنجليزيّة: VoIP)، والبريد الإلكتروني، والتراسل الفوري. البرامج المساعدة: كالبرامج المتخصّصة في تنظيم القرص الصلب، ومعالجة الملفّات، وبرامج التعريف (بالإنجليزيّة: Device Drivers)، وأنظمة التخزين والأرشفة. لغات البرمجة والبرمجيّات التابعة لها: كبرامج التعديل على الملفّ المصدريّ للبرامج، والمحوِّل البرمجي (بالإنجليزيّة: Compiler)، بالإضافة إلى برامج التّصحيح (بالإنجليزيّة: Debuggers). مجال أمن المعلومات: كالبرامج المضادّة للفيروسات (بالإنجليزيّة: Anti-Virus)، وجُدُر الحماية (بالإنجليزيّة: Firewall)، بالإضافة إلى البرمجيّات المتخصّصة بالتّشفير والمصادقة. مُتطلّبات العمل في مجال هندسة الحاسوب تتطلَّب معظم وظائف هندسة الحاسوب أن يكون الشخص حاملاً لشهادة البكالوريوس في هندسة الحاسوب، وقد تطلب بعض الشركات شهادة الماجستير في حال أرادت ترفيع الموظَّف ليستلم منصباً إداريّاً. وعلى مهندس الحاسوب أن يبقى دائماً مواكباً لأحدث تطوّرات التكنولوجيا، وذلك عن طريق التعلُّم المستمرّ، بالإضافة إلى التدريب. يُذكرُ أنّ العديد من مهندسي الحاسوب هم أعضاءٌ في معهد مهندسي الكهرباء والإلكترونيّات (بالإنجليزيّة: IEEE).[١]\n",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/computer%20engineer.jpg?alt=media&token=08b45ef5-3385-4ae4-b97e-b1de5e2cfa67"));
        list.add(new category_class("cs", R.mipmap.cs, "CS", "\n" +
                "علوم الحاسب أو الحوسبة أو علوم الكمبيوتر Computer science منهج علمي وعملي يختص بالحوسبة وتطبيقاتها، بالإضافة إلى كونه نوعاً من الدراسات المنهجية التي تهدف إلى دراسة الجدوى feasibility، والبنية structure، والكثير من المصطلحات والعبارات expression والمكننة mechanization والخوارزميات methodical procedures، التي تهدف إلى تخزين المعلومات ومعالجتها، ثمّ القيام بالاتصالات والتقديمات بهدف الوصول إلى المعلومات المطلوبة، ولإتقان علوم الحاسب يجب دراسة برمجيات الحاسوب وعتاد الحاسوب بطرق علمية، والتخصص بعالم الكمبيوتر، ونظريات الحوسبة، وتصميم الأنظمة الحاسوبية.\n" +
                "\n" +
                "\n" +
                "\n" +
                "تعريف علوم الحاسب\n" +
                "علوم الحاسب هو علم مختص بإمكانية تطبيق المعرفة التي تنتج عن الحاسوب والرياضيات على كافة فروع المعرفة، مع إمكانية تحليل المعضلات وتحديد متطلبات حلها باستعمال الحاسوب، مع القيام بجميع التصميمات اللازمة، ثمّ تنفيذها وتقييم النظام وكافة العمليات الأخرى والبرامج التي تستعمل، لتسهيل العمل بفعالية أكبر وتحقيق الأهداف المشتركة الخاصة بالفرق والمجموعات.\n" +
                "\n" +
                "\n" +
                "\n" +
                "لمحة تاريخية عن علوم الحاسب\n" +
                "يرجع فضل اختراع أول آلة حاسوب إلى العالم تشارلز بابيج Charles Babbage، أما آدا لوفلايس Ada Lovelace فهي أول من كتب الخوارزميات algorithm من أجل عمل معالجة processing على الحاسوب .\n" +
                "\n" +
                "\n" +
                "\n" +
                "فروع علوم الحاسب\n" +
                "علم الحاسوب النظري: يتم من خلاله دراسة اللغات الصورية، وجميع نظريات الحوسبة، أو الخوارزميات، وآلية حساب التكاليف.\n" +
                "علم الحاسوب العملي: يختص بدراسة مهارات ترجمة اللغات الصورية، بالإضافة إلى النظريات، والخوارزميات، التي تحول بعد ذلك إلى تطبيقات من الممكن تداولها بسهولة، وتطويرها بشكل منتظم يتماشى مع العلوم الأخرى، وكافة مجالات الحياة.\n" +
                "علم الحاسوب التطبيقي: هو العلم الذي يهتم بالتطبيقات المتعددة للحاسوب في نواحي الحياة المختلفة مثل: التصميم، والتصنيع باستعمال الحاسب، بالإضافة إلى تسيير الأنظمة الإدارية والصناعية.\n" +
                "هندسة الحاسوب: هو الفرع الذي يهتم بطريقة عمل مُعدّات الحاسوب أو ما يعرف أيضاً بعتاد الحاسوب، وصناعة الحواسيب التي تعتمد على الكثير من النواحي مثل: الهندسة المعلوماتية النظرية، والفيزياء، بالإضافة إلى علم الكيمياء، والإلكترونيات.\n" +
                "\n" +
                "\n" +
                "أقسام أخرى لعلوم الحاسب\n" +
                "علم الخوارزميات والبيانات النظرية: يعنى بدراسة الجانب النظري في علوم البيانات.\n" +
                "علم التقنيات الحاسوبية: يعنى بدراسة الجانب العملي الذي يشمل التحليل والتصميم، ثمّ بناء الأساسيات الصلبة للحواسيب.\n" +
                "\n" +
                "\n" +
                "تخصص علوم الحاسب\n" +
                "يدرس الطالب الذي سيتخصص بعلوم الحاسب الكثير من المجالات المتنوعة، مثل: دراسة علم الرياضيات مع التركيز على التفاضل والتكامل calculus، والجبر الخطي، حيث يعتبر علم الرياضيات من أهم العلوم الأساسية في برمجة الحاسوب، حيث يساعد على معالجة الحاسوب للبيانات، كما يدرس الطالب الكثير من لغات البرمجة الشهيرة مثل: برنامج java وبرنامج HTML، والقليل من علوم الدارات الإلكترونية وآلية عملها، وعلوم الخوارزميات أثناء السنة الثالثة والرابعة.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/cs.jpg?alt=media&token=44f203e0-ea4e-45dc-ba58-aee501634b21"));
        list.add(new category_class("machinelearning", R.mipmap.machinelearn, "D_Science", "تعليم أو تعلم الآلة هو أحد فروع أو مجالات الذكاء الإصطناعي، الذي يوفر للآلة القدرة على التعلم و التأقلم مع العالم البشري، تُطور هذه الأخيرة بواسطة خوارزميات و تقنيات تسمح للحاسوب بإمتلاك خاصية التعلم مثل البشر أو الكائنات الحية، و سنقدم في مقالنا هذا تعريف و لمحة بسيطة عن تعليم الآلة و بعض الأمثلة لإستخداماتها و تطبيقاتها، و بعض الروابط لمساعدتك أكثر في فهم جيد لهذا المجال.\n" +
                "ما هو تعليم الآلة Machin Learning :\n" +
                "تعليم الآلة هو مجال و علم رائع لا يمكننا إعطائه حقه في مقال واحد و لكن سنحاول، تعليم الآلة هو علم يرتكز على الذكاء الإصطناعي بل وهو فرع من فروع الذكاء الإصطناعي و له علاقة طردية مع تحليل البيانات أيضاً، حيث أعطى العلماء عدة مفاهيم و تعريفات عن تعلم الآلة، و كان أبرزها وصف العالِم آرثر صامويل : تعلم الآلة هو الفرع العلمي الذي يعطي الحاسوب القدرة على التعلم دون أن تتم برمجتها بشكل صريح، إذاً تعليم الآلة هو إعطائها مجموعة من التعليمات و التقارير بالإضافة إلى تمكينها مسائل البحث لكي تعطي أفضل النواتح الممكنة، أي إمتلاك الحاسوب أو الآلة خصائص التعلم، و ينقسم مصطلح التعلم إلى قسمين هما : الإستقرائي و الإستنتاجي؛ الإستقراء هو تلقي المعلومة و قرائتها و تحليلها جيداً و البحث عن الحل المناسب أما الإستنتاجي هو الخروج بنتيجة عامة و مرضية سوىللمستخدم أو المالك، و يُبنى تعلم الآلة على خوارزميات قادرة على التعلم من البيانات و تقديم الإحتمالات و التنبؤات التي تساعدها مرة أخرى أيضاً على إعطاء نتيجة أفضل من السابقة و الإستمرار في التطور...\n" +
                "أمثلة لإستخدامات تعليم الآلة :\n" +
                "كما ذكرنا تعليم الآلة يستخدم في عدة مجالات أصبحت رئيسية في عالمنا الواقعي، بل و أصبحت ضرورية أيضاً، و نذكر أبرزها : مساعدة الآلة للطبيب في إكتشاف مرض ما، أيضاً من الممكن للآلة أن تقوم بتنبؤ أحداث كارثية ما و إشعارنا بها و إعطائنا الحلول الممكنة لها، مثلاً تنبؤات الطقس و الكوارث الطبيعية، التعرف على حالة الطائرة و حالة الركاب، و كل مرة تساعدنا الآلة في إكتشاف حالات و علوم جديدة، يمكن للآلة الآن إجراء عملية جراحية بدلاً من الطبيب و تكون نسبة نجاح العملية كبيرة لأنها دقيقة للغاية، و الكثير الكثير من تطبيقات تعلم الآلة منها : محركات البحث، التعرف على الكلام، التشخيص و الفصح الطبي، الإقتصاد، تصنيف سلاسل الأحماض النووية \"DNA\" ... حيث يمكنها مساعدتنا في عدة أشياء لا نقدر على تأديتها نحن، و بإختاصار شديد : نحتاج تعليم الآلة و الآلة في كل شيئ و في كل مكان و في كل الأحوان.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/machine%20learning.jpg?alt=media&token=17616bad-230b-4294-8fad-82c5e7c6e84f"));

        list.add(new category_class("xamarin", R.mipmap.xamarin, "Xamarin", "تُعتبر منصّة Xamarin في الوقت الحالي، من أهمّ منصّات تطوير تطبيقات الأجهزة المحمولة المتوفّرة، والتي يبدو أنّها ستبقى على الواجهة لوقت ليس بالقليل، خصوصًا بعد استحواذ شركة مايكروسوفت على الشركة المنتجة لها والتي تحمل أيضًا نفس الاسم (Xamarin). قد تكون متحفّزًا للدخول في عالم تطوير تطبيقات الأجهزة المحمولة (كما كنت عندما تعرّفت للمرّة الأولى على Xamarin) ومستعدًّا لكتابة الشيفرة مباشرةً، ولكن لنصبر قليلًا، ولنفهم بدايات الأمور، ومبدأ عمل Xamarin بشكل أفضل ضمن هذا المقال، الذي يُعدّ الأوّل في سلسلة مقالات سترشدك إلى كيفيّة تطوير تطبيقات باستخدام منصّة Xamarin مع إنشاء تطبيقات عمليّة من خلالها.\n" +
                "\nلإنشاء تطبيقات على أنظمة iOS فأنت تحتاج إلى إتقان لغة البرمجة Objective-C أو لغة البرمجة Swift. وأن تمتلك حاسوب MacBook (أي إصدار) مع بيئة التطوير Xcode.\n" +
                "لإنشاء تطبيقات على أنظمة Android فستحتاج إلى لغة جافا Java مع بيئة التطوير Android Studio التي تعمل على العديد من أنظمة التشغيل.\n" +
                "أمّا لإنشاء تطبيقات تعمل على Windows Phone أو Windows 10 Mobile فأنت بحاجة إلى لغة البرمجة سي شارب C# مع حاسوب يشغّل ويندوز، وإلى بيئة التطوير Visual Studio يمكن تجاوز جميع النقاط السابقة من خلال Xamarin لأنّها توفّر لغة برمجة وحيدة وهي سي شارب يمكن استخدامها لكتابة تطبيقات على أيّ نظام تشغيل. كما أنّها توفّر بيئة تطوير متقدّمة ووحيدة وهي Visual Studio 2015 لكتابة هذه التطبيقات (يمكن استخدام بيئة التطوير Xamarin Studio أيضًا بالنسبة لنظام Mac). بالإضافة إلى أنّها وحّدت الواجهات البرمجيّة المختلفة API ضمن واجهة برمجيّة وحيدة يتعامل معها المطوّر.\n" +
                "\n" +
                "لغة سي شارب غنيّة عن التعريف. فهي لغة قويّة ومرنة وغنيّة جدًا ودائمة التطوير. لقد أصبحت بحق من أكثر لغات البرمجة تطوّرًا وحداثةً. ولسنا هنا بصدد تفضيل لغة برمجة على أخرى، ولكن بحسب خبرتي الشخصيّة، واطّلاعي على العديد من لغات البرمجة الأخرى، تستطيع القول بأنّ سي شارب تحتلّ موقعًا مرموقًا بينها.\n" +
                "\n" +
                "يستطيع المطوّرون من أجل تطبيق محدّد، كتابة شيفرة واحدة مشتركة لجميع أنظمة التشغيل السابقة بدون أيّة تعديلات تُذكر عليها فيما يتعلّق بمنطق العمل business logic داخل التطبيق وبما يتضمنّه من عمليّات برمجيّة لا تتعلّق بنوع الجهاز المحمول أو نظام التشغيل الذي يعمل عليه. نسمّي هذه الشيفرة بالشيفرة المستقلة عن نظام التشغيل platform independent. أمّا إذا تطلّب الأمر من التطبيق أن يتعامل مع العتاد الصلب للجهاز الذي يعمل عليه (مثل الكاميرا أو حسّاس GPS مثلًا)، فيمكن عندها كتابة أجزاء من الشيفرة التي تراعي خصوصيّة كل نظام تشغيل، نسمّي مثل هذه الشيفرة بالشيفرة المرتبطة بنظام التشغيل platform dependent.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/xamarin.jpg?alt=media&token=b88139c6-6ea8-4025-9977-1a491f35172a"));

        list.add(new category_class("security", R.mipmap.security, "Security",
                "watch this --> https://youtu.be/wc0rLWLJptU"
                ,
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/security.jpg?alt=media&token=16f5395c-5eef-4d51-b935-b92c5d94cf10"));
        list.add(new category_class("c_sharp", R.mipmap.c_sharp, "C#", "watch this -->" +
                "https://youtu.be/CVNHn99U7go",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/c%23.jpg?alt=media&token=3e07a0b3-1f14-4eb3-8625-08b92e2d07bd"));
        list.add(new category_class("network", R.mipmap.network, "Networks", "",
                "https://firebasestorage.googleapis.com/v0/b/signin-signup-ui-design-43047.appspot.com/o/network.jpg?alt=media&token=d7767bda-7210-4a0c-9287-925cc638b03d"));
        list.add(new category_class("mangement", R.mipmap.mang, "Mangement", "See this link --> ",
                "https://firebasestorage.googleapis.com/v0/b/signin-signup-ui-design-43047.appspot.com/o/mang.jpg?alt=media&token=7cf9cd17-2663-4b9f-9ce6-6d4c61c8f2df"));
        list.add(new category_class("cs&ce", R.mipmap.dep, "CS vs CE", "\n" +
                "بسم الله الرحمن الرحيم\n" +
                "\n" +
                "طبعا لقيت ناس كتير متلغبطة ومش عارفة الفرق بين الكليات اللى ف مجال الحاسب فانا عملت الموضوع دا عشان احاول اوصلكوا الفرق وكتبت حجات مختصرة عشان متتعبوش ف القراءة\n" +
                "\n" +
                "اولا هندسة\n" +
                "\n" +
                "دى بتهتم بالسوفتوير والهاردوير بس طبعا الاهتمام الاكتر بالهارد وير\n" +
                "بيدرسوا الكترونيات وشبكات ودواير منطقية\n" +
                "ودى المواد اللى بيدرسوها (ممكن تختلف من كلية لكلية بس اختلاف بسيط)\n" +
                "\n" +
                "رياضيات 3\n" +
                "انسانيات في هندسة النظم 2\n" +
                "اساسيات اليكترونيه\n" +
                "دوائر منطقيه ورقميه 1\n" +
                "لغات برمجه 1\n" +
                "هندسة التحكم 1\n" +
                "رياضيات 4\n" +
                "تقارير فنيه في هندسة النظم\n" +
                "هندسة تشغيل حاسب 1\n" +
                "مقدمه في شبكات الحاسب\n" +
                "هندسة التحكم 2\n" +
                "\n" +
                "رياضيات 5\n" +
                "إنسانيات في هندسة النظم 3\n" +
                "دوائر منطقية ورقمية 2\n" +
                "لغات برمجة 2\n" +
                "أجهزة قياس ومستشعرات\n" +
                "نمذجة ومحاكاة النظم\n" +
                "تطبيقات إحصائية\n" +
                "هندسة تشغيل حاسب 2\n" +
                "لغات برمجة 3\n" +
                "قوى وآلات كهربية\n" +
                "تمييز مكونات النظم\n" +
                "نظم تحكم رقمى\n" +
                "\n" +
                "هندسة معمار الحاسب1\n" +
                "هياكل البيانات والخوارزميات\n" +
                "قواعد بيانات1\n" +
                "نظرية التحكم الحديثة\n" +
                "ذكاء اصطناعي\n" +
                "التحكم المنطقي المبرمج\n" +
                "قواعد بيانات2\n" +
                "تحليل وتصميم نظم الحاسب\n" +
                "رسم بالحاسب\n" +
                "نظم تحكم بالحاسبات1\n" +
                "\n" +
                "هندسة معمار الحاسب2\n" +
                "تصميم وبرمجة شبكات\n" +
                "طرق تعلم الآلة\n" +
                "مشروع *\n" +
                "صيانة حاسب\n" +
                "أنظمة الحاسبات الموزعة\n" +
                "نظم تحكم بالحاسبات2\n" +
                "مشروع *\n" +
                "\n" +
                "زى ما شوفتوا كدا بيهتم بالسوفتوير والهارد وير بس بيتميز اوى ف الهارد وير يعنى بتحب تتعمق ف اجزار الكمبيوتر الداخالية يبقى هندسة احسن بتحب البرمجة والداتابيز وشغل السوفتوير يبقى حاسبات احسن\n" +
                "\n" +
                "بردو فى ناس ممكن متكونش عارفة هندسة الكترونية\n" +
                "\n" +
                " اختلاف هندسة الحاسوب عن علم الحاسوب يشترك تخصّصا هندسة الحاسوب وعلم الحاسوب (بالإنجليزيّة: Computer science) بأنَّ كليهما يتعاملان مع البيانات وأنظمة الحاسوب بشكلٍ مباشر، كما أنّهما يعتمدان على جهاز الحاسوب في حل المشكلات المختلفة. وبالإضافة إلى ذلك، فإنَّ كلا التخصّصين يساهمان في تطوُّر التقنيات الحاسوبيّة. وعلى الرّغم من كلّ ذلك، إلّا أنّ هناك اختلافات شاسعة موجودة بين التخصّصين؛ فهندسة الحاسوب تتعامل مع أجهزة الحاسوب على مستوى الدّارات الكهربائيّة الدّاخلة في تكوين عتادها، كما أنّها تسعى لحلّ المشكلات الكهربائيّة المختلفة التي تحصل في أجهزة الحاسوب، وكذلك فإنّ هندسة الحاسوب أيضاً تتخصَّص في دمج كلّ من العتاد والبرمجيّات بأفضل الطرق والوسائل لضمان فاعليّتها على أكمل وجه.[٥] أمّا علم الحاسوب، فيمكن اعتباره تخصّصٌ واقعٌ بين مجالي عمل هندسة الحاسوب؛ فالمتخصّصين في مجال علم الحاسوب يقومون بتطوير البرمجيّات، وإنشاء قواعد البيانات، واشتقاق الخوارزميّات، وتأمين البيانات أثناء معالجتها في أنظمة الحاسوب، بالإضافة إلى التعامل مع شبكات الحاسوب.[٥] اختلاف هندسة الحاسوب عن هندسة البرمجيّات يتخصَّص مهندسو البرمجيّات في بناء وتطوير أنظمة البرمجيّات؛ فبالمقارنة مع هندسة الحاسوب، فإنّ هندسة البرمجيّات تميل بشكلٍ كبير إلى التعامل مع التطبيقات البرمجيّة الضخمة، ورسم خطط هذه البرمجيّات من لحظة كونها مجرَّد فكرة، إلى أن تصبح منتجاً نهائيّاً جاهزاً للاستخدام، كما أنَّ مهندسي البرمجيّات يلجأون إلى وسائل منظّمة ومبتكرة لضمان جودة البرمجيّات وأمنها.\n" +
                "\n" +
                "إقرأ المزيد على موضوع.كوم: https://mawdoo3.com/%D9%85%D8%A7_%D9%87%D9%8A_%D9%87%D9%86%D8%AF%D8%B3%D8%A9_%D8%A7%D9%84%D9%83%D9%85%D8%A8%D9%8A%D9%88%D8%AA%D8%B1 , قسم حاسب فيها هو هو هندسة قسم حاسب اساسا الكلية دى هيه قسم كهربا كدا اللى ف هندسة",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/departments.png?alt=media&token=a8627626-0bbf-4703-a121-4bd74f991b64"));
        list.add(new category_class("c++", R.mipmap.c, "C++", "سي++ (تنطق: سي بلس بلس) (بالإنجليزية: ++C) هي لغة برمجة كائنية، متعددة أنماط البرمجة، مصرفة، سكونية الأنماط. وتضم العديد من ميزات لغات البرمجة عالية المستوى ومنخفضة المستوى. بدأ تطوير هذه اللغة امتدادًا للغة سي تحت اسم (سي مع الأصناف) من قبل بيارن ستروستروب في مختبرات بل عام 1979 وتم إضافة العديد من الميزات الأخرى لاحقاً وتغير الاسم عام 1983 ليصبح سي++  من باب الدعابة عبر استخدام معامل الزيادة لجانب اسم لغة سي تأكيداً على أنها «التالي للغة سي».\n" +
                "\n" +
                "تعتبر سي++ إحدى اللغات الأكثر شيوعاً وقد استخدمت على نطاق واسع في بناء أنظمة التشغيل والتعامل مع البنية الصلبة للحاسوب ابتداءً من الأنظمة البرمجية وبرامج المستخدم، مروراً بمشغلات الأجهزة والأنظمة المضمنة وانتهاءً بالخوادم عالية الأداء وبرامج التسلية كالألعاب الفيديوية نظراً لقدرة تصريفها إلى كود لغة تجميع شديد الفعالية. أحد أكثر استخدامات سي++ إثارةً للإعجاب حسب رأي ستروستروب هو استخدام سي++ في كتابة قسم كبير من أنظمة القيادة الأوتوماتيكية للعربات التي تجولت على سطح المريخ (مارس روفر) .\n" +
                "\n" +
                "يوجد العديد من المصرفات التجارية والمفتوحة المصدر لـسي++، من هذه المصرفات مشروع جنو، مصرفات إنتل، مصرفات مايكروسوفت، مصرفات استديو أوراكل سولاريس، مصرفات ديجيتال مارس، ومصرفات إيمباركاديرو تكنولوجيز. لقد أثرت لغة سي++ في العديد من لغات البرمجة الشائعة مثل سي شارب  وجافا. في حين تستخدم لغات أخرى مثل لغة سي-الكائنية نحواً شديد الاختلاف ومقاربة مختلفة في إضافة الأصناف إلى سي.\n" +
                "\n" +
                "بدأت سي++ بصفتها تحسينا للغة سي، أولاً عبر إضافة الأصناف ومن ثم التوابع الظاهرية وتحميل المعاملات الحسابية والوراثة المتعددة والقوالب ومعالجة الاستثناءات بالإضافة إلى ميزات الأخرى. بعد سنوات من التطوير تم تصديق سي++ عام 1998 معيار آيزو ذو الاسم ISO/IEC 14882:1998. وفي عام 2003 تم تعديل المعيار وفقاً لوثيقة التصحيح التقنية ISO/IEC 14882:2003. يتضمن المعيار الحالي ISO/IEC 14882:2011 مجموعة من الميزات التي تم الاتفاق عليها ونشرها مثل معيار جديد من المنظمة الدولية للمعايير في أيلول 2011 والذي عُرف سابقاً باسم سي++ 11.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/c%2B%2B.png?alt=media&token=756437d0-4dd0-40b4-be31-0dedd065d4aa"));

        list.add(new category_class("python", R.mipmap.python, "python", "بايثون (بالإنجليزية: Python) هي لغة برمجة، من لغات المستوى العالي، تتميز ببساطة كتابتها وقراءتها، سهلة التعلم، تستخدم أسلوب البرمجة الكائنية، مفتوحة المصدر، وقابلة للتطوير. تعتبر لغة بايثون لغة تفسيرية، متعددة الأغراض وتستخدم بشكل واسع في العديد من المجالات، كبناء البرامج المستقلة باستخدام الواجهات الرسومية المعروفة وفي عمل برامج الويب، بالإضافة إلى استخدامها كلغة برمجة نصية للتحكم في أداء بعض من أشهر البرامج المعروفة أو في بناء برامج ملحقة لها. وبشكل عام يمكن استخدام بايثون لبرمجة البرامج البسيطة للمبتدئين، ولإنجاز المشاريع الضخمة كأي لغة برمجية أخرى في نفس الوقت. غالباً ما يُنصح المبتدؤون في ميدان البرمجة بتعلم هذه اللغة لأنها من بين أسرع اللغات البرمجية تعلماً.\n" +
                "\n" +
                "نشأت بايثون في مركز CWI (مركز العلوم والحاسب الآلي) بأمستردام على يد جايدو ڤان روسم في أواخر الثمانينات من القرن المنصرم، وكان أول إعلان عنها في عام 1991. تم كتابة نواة اللغة بلغة سي. أطلق ڤان روسم الاسم \"بايثون\" على لغته تعبيرًا عن إعجابه بفِرقَة مسرحية هزلية شهيرة من بريطانيا، كانت تطلق على نفسها الاسم مونتي بايثون.\n" +
                "\n" +
                "تتميز بايثون بمجتمعها النشط، كما أن لها الكثير من المكتبات البرمجية ذات الأغراض الخاصة والتي برمجها أشخاص من مجتمع هذه اللغة، مثلاً مكتبة باي جايم التي توفر مجموعة من الوظائف من أجل برمجة الألعاب. ويمكن لبايثون التعامل مع العديد من أنواع قواعد البيانات مثل ماي إس كيو إل وغيره",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/python.jpg?alt=media&token=cdc2fd58-7c24-4858-ab75-77c8e5001552"));

        list.add(new category_class("java", R.mipmap.java, "java", "افا (بالإنجليزية: Java) هي لغة برمجة موجهة للكائنات، ابتكرها جيمس غوسلينغ في عام 1992م -أثناء عمله في مختبرات شركة صن ميكروسيستمز- وذلك لاستخدامها بمثابة العقل المفكر المستخدم لتشغيل الأجهزة التطبيقية الذكية مثل التليفزيون التفاعلي، وقد كانت لغة الجافا تطويرًا للغة سي ++، وعند ولادتها أطلق عليها مبتكرها \"أواك\" بمعنى شجرة السنديان؛ وهي الشجرة التي كان يراها من نافذة مكتبه وهو يعمل في مختبرات صن ميكروسيستمز، ثم تغير الاسم إلى جافا، وهذا الاسم (على غير العادة في تسمية لغات البرمجة) ليس الحروف الأولى من كلمات جملة معينة أو تعبيرًا بمعنى معين، ولكنه مجرد اسم وضعه مطورو هذه اللغة لينافس الأسماء الأخرى.تتميز لغة جافا بمميزات خاصة  مما يجعلها أكثر لغات البرمجة إثارة؛ حيث أن ما يميزها الآتي:\n" +
                "\n" +
                "السهولة.\n" +
                "داعمة و موجهة للكيانات.\n" +
                "سهولة الحصول عليها.\n" +
                "امنة.\n" +
                "قابلة للنقل و التنفيذ.\n" +
                "إضافة الحركة والصوت إلى صفحات الويب.\n" +
                "كتابة الألعاب والبرامج المساعدة.\n" +
                "إنشاء برامج ذات واجهة مستخدم رسومية.\n" +
                "تصميم برمجيات تستفيد من كل مميزات الأنترنت. توفر لغة الجافا بيئة تفاعلية عبر الشبكة العنكبوتية وبالتالي تستعمل لكتابة برامج تعليمية للإنترنت عبر برمجيات المحاكاة الحاسوبية للتجارب العلمية وبرمجيات الفصول الافتراضية للتعليم الإلكتروني والتعليم عن بعد. لا تنحصر فاعلية الجافا في الشبكة العنكبوتية فقط بل تمكننا من إنشاء برامج للاستعمال الشخصي والمهني، هذه البرامج تنجز عبر جملة من البرامج التي تسهل كتابة الأوامر كبرنامج نت بينز واكليبس.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/java.jpg?alt=media&token=379cea37-2049-4f82-8e1b-9cd0f743d048"));
        list.add(new category_class("kotlin", R.mipmap.kotlin, "kotlin", "كوتلن (بالإنجليزية: Kotlin) هي لغة برمجة كائنيّة Object Oriented تعمل على منصة جافا كما يُمكن تشغيلها على منصة لغة جافا سكريبت. طوّر اللغة مجموعة من المُبرمجين في شركة جيتبراينز والتي يقع مقرّها في سانت بطرسبرغ في روسيا -حيث أن اسم اللغة مستوحى من جزيرة كوتلن القريبة من المدينة- وهي نفس الشركة التي طورت أندرويد استوديو الأداة الرسمية لتطوير تطبيقات أندرويد. وقد تم تصميم كوتلن للتعامل والتوافق الكامل مع الجافا وحزمة تطويرها JDK ومكتبة الأكواد وتتيح كتابة الشيفرة البرمجية بعدد أقل من الأسطر وبشكل أسرع وأكثر فاعلية مقارنةً بلغة جافا، حيث تُعتَبر شبيهة بلغة سويفت من أبل.\n" +
                "\n" +
                "التاريخ\n" +
                "في عام 2011 كشفت شركة جيتبراينز عن مشروعة لغة كوتلن، وهي لغة جديدة لـJVM، والتي كانت قيد التطوير لمدّة عام. وقد قال مدير الشركة ديمتري جيميروف حينها أن مُعظَم اللغات لم يكن فيها الميّزات التي يبحثون عنها، باستثناء لغة السكالا التي تُعتَبر بطيئة نوعاً ما أثناء تشغيل التطبيقات. وكان أحد أهداف كوتلن في تشغيل التطبيقات في نفس سُرعة تشغيل الجافا لها. وبحلول فبراير 2012، فتحت الشركة المشروع للمُساهمين ليُصبح مفتوح المصدر تحت رخصة أباتشي.\n" +
                "\n" +
                "صدرت النُسخة الأولى من اللغة في 15 فبراير 2016. وقد اكتسبت اللغة أهمّيتها بعد أن أعلنت جوجل في موتمر المطورين في 17 مايو 2017، أعلنت عن دعمها الرسمي للغة البرمجة كوتلن كلغة من الصنف الأول First-Classs، مدعومة  افتراضيًا، لكتابة تطبيقات أندرويد، بدءًا من إصدار Android Studio 3.0",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/kotlin.jpg?alt=media&token=92f54f67-d6e9-4260-9412-8e4b048de617"));
        list.add(new category_class("gaming", R.mipmap.gaming, "Gaming", "See the link , , " +
                "https://www.facebook.com/robabekia.sci/posts/1207974675994588/",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/gaming.jpg?alt=media&token=f2a19b98-c55f-41d2-86c1-6571eefba947"));
        list.add(new category_class("ios", R.mipmap.ios, "IOS", "أولًا: لغة سويفت Swift هي الخطوة الأولى\n" +
                "كانت اللغة المُستخدمة في برمجة تطبيقات آي أو إس IOS (تطبيقات الآيفون) هي لغة Objective-C إلا أن شركة Apple أعلنت عام 2014 في مؤتمر Apple العالمي للمطورين (WWDC) عن لغة برمجية مفتوحة المصدر أتت لتستبدل لغة Objective-C ألا وهي لغة Swift، ومنذ ذلك الحين – وبالرغم من استمرارية البعض في استخدام اللغة البرمجية القديمة – أصبحت لغة Swift البداية بل الخطوة الأهم لكل من يريد تعلّم تطبيقات الآيفون (iOS).ثانيًا: متطلبات برمجة تطبيقات iOS (تطبيقات الآيفون)جهاز يعمل بنظام ماكنتوش: لكي تتمكن من برمجة تطبيقات iOS يجب أن يكون لديك جهاز MAC، فليس من المعقول أن تقوم ببرمجة تطبيقات لنظام وأنت لا تملك الأدوات التي تعمل عليها التطبيقات بشكل افتراضي. البعض يقوم بتنصيب نظام ماكنتوش افتراضي على الويندوز باستخدام الأنظمة الوهمية، هذه الطريقة قد تنفع ولكن من الوارد ألا تعمل معك التطبيقات بالشكل الصحيح ولكن استخدام النظام الافتراضي يظل حلًا لمن ليس لديهم الإمكانية لشراء جهاز MAC.\n" +
                "برنامج X-Code: يجب تسجيل حساب مطور على موقع Apple، بهدف تحميل برنامج X-code والذي يستخدم في كتابة أوامر لغة سويفت وإنشاء التطبيق النهائي، ولعلك تعرف أن Apple توفر حساب مطور مجاني لمتابعة الأخبار والمدونات والاحصائيات الخاصة بالتطبيقات ويسمح لك الحساب المجاني أيضًا بتحميل برنامج X-code ولكنه لا يُعطيك كافة المميزات اللازمة، كاختبار التطبيق على الحاسوب، كذلك يمنعك من رفع التطبيق على متجر Apple بعد الانتهاء منه؛ لذلك سوف تحتاج بالتأكيد إلى حساب مطور مدفوع والذي يبلغ قيمته حوالي 100 دولار سنويًا.\n" +
                "لغة سويفت Swift: تعلم لغة سويفت Swift البرمجية والتي تستخدم في برمجة تطبيقات iOS، وقد تحدّثنا عن هذه اللغة في بداية هذا المقال.\n" +
                "لغة إنجليزية قوية: بالرغم من توفر دورات تعليمية تشرح لغة سويفت باللغة العربية، إلا أن تمكّنك من اللغة الإنجليزية سوف يوفر عليك وقتًا طويلًا؛ وذلك لأن معظم المصادر باللغة الإنجليزية.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/ios.jpg?alt=media&token=66eb1443-dc20-4ed3-bced-aaf6a38f07e2"));
        list.add(new category_class("testing", R.mipmap.testing, "Testing", "الUnit Test هي وسيلة مفيدة جداً لعمل الاتي\n" +
                "\n" +
                "1- التأكد من أن الكود الذي تكتبه ينفذ ما تريد خاصة اذا كان الكود في مكتبة ليس لها واجهة رسومية للتجربة\n" +
                "\n" +
                "2- بمجرد التأكد من وجود اختبارات كافية يمكنك التحرك و التغيير بحرية داخل الكود دون خوف من أن تتسبب تغييراتك في تغيير شئ لايجب أن يتغير, لأن كل ما عليك هو أن تعيد تشغيل الUnit Tests بعد أن تقوم بتغييراتك و ان سارت على مايرام هذا يعطيك ثقة أن تغييراتك لم تعطب البرنامج الأصلي\n" +
                "\n" +
                "3- مجرد التفكير في قابلية الكود لعمل Unit Testing عليه تجعلك تكتب كود أفضل و تحاول أن تحدد الDependencies التي تعتمد عليها و وضع Interfaces حولها حتى يتسنى لك عمل Mocking لها أثناء عملية الTesting فمثلاً لو كان برنامجك يعتمد على بيانات يتم قراءتها من قاعدة بيانات فأثناء عملية الUnit testing من المفضل أن لا تقرأ بياناتك من قاعدة البيانات التي تعتبر External Dependency و التي يجب أن تقوم بعزلها عن طريق وضع Interface بين المناطق التي تحتاج البيانات و مصدر البيانات و هنا يمكنك تجربة الكود عن طريق تحميلها من ملفات على الجهاز مثلاً و التأكد من أن كودك يعمل دون مشاكل دون الحاجة الى وجود قاعدة بيانات كبيرة و التي لا تحتمل أن يتم تحميلها كل مرة تقوم بتمرير الUnit tests\n" +
                "\n" +
                "هناك الكثير من الفوائد و لكن ماذكرته هو ما أجد أنه مهم بالنسبة لي..",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/testing.png?alt=media&token=743961d0-fa71-47d4-bf3b-8fddb58d828f"));
        list.add(new category_class("embded", R.mipmap.embeded, "Embeded", "الEmbedded System يطلق على الحواسيب البسيطة التى تستخدم غالبا كجزء من جهاز أو نظام أكبر من أجل مهمة معينة و محددة و بسيطة (بعكس الحاسوب المتعدد الاستخدامات). غالبا ما تستخدم مثلا لجمع المعلومات من حساسات ثم توجيه محرك أو اعطاء أمر ما,\n" +
                "\n" +
                "هى عبارة عن حواسيب و لكنها أبسط لتتناسب مع قدر المهمة,\n" +
                "\n" +
                "تبرمج الEmbedded System غالبا مباشرة عبر حرق اكواد الassembly او الc على الROM الخاص بها بعد ترجمتها,\n" +
                "\n" +
                "برمجة الEmbedded System بسيطة نوعا ما و لكنها تحتاج الى دراسة جيدة لقدرات الدائرة و مخرجاتها و مدخولاتها,\n" +
                "\n" +
                "و تبرمج عادة على الAssembly او الC, و هناك أيضا مترجمات بيسك و باسكال, لكن هذا ليس معتادا.\n" +
                "\n" +
                "ميزتها الاساسية انها أقل تعقيدا من الحاسوب التقليدى, ما يعنى انها اكثر استقرارا و ليس بها مشاكل الحاسوب المعتادة مثل عدم الاستقرار و السخونة, و بالتالى تؤدى مهمتها دائما بدون أخطاء.لا يشترط تخصص معين, يكفى المعرفة بمبادىء الدوائر الكهربائية و البرمجة و طبعا المجال الذى سوف تستخدم فيه النظام. فأنت تتداخل بين علم البرمجة و الالكترونيات بالاضافة الى التخصص الذى يستخدم فيه الEmbedded System, قد يكون سيارة مثلا,\n" +
                "\n" +
                "فعليك ان تكون فى هذه الحالة مهندس الكترونيات و مهندس برمجيات و مهندس سيارات فى الوقت نفسه,\n" +
                "\n" +
                "أنا مهندس مثلك و أعرف جيدا ان المهندس مهما كان تخصصه يستطيع ان يعمل بأى مجال هندسى غير تخصصه.\n" +
                "\n" +
                "باختصار لكل مشروع دراسة حالة عليك الالمام بها, و مبادىء العلوم الاولية التى نحفظها جميعا تكفى.\n" +
                "\n" +
                "سوق عمله موجود فى مصر و مزدهر, هناك العديد من الشركات التى تصمم أنظمة تعتمد على الEmbedded Systems, أو تستخدمها فى عملياتها و تصمم داخليا, فى عملى فى مجال البترول شاركت فى تصميم Embedded Systems و برمجتها. و الأمر ليس صعب لكنه يحتاج الى :\n" +
                "\n" +
                "دراسة الدائرة التى سوف تعمل عليها بشكل جيد, من حيث قدراتها, و مدخولاتها و مخرجاتها.\n" +
                "\n" +
                "دراسة لغة الاسمبلى الخاصة بالدائرة جيدا, حتى لو كنت سوف تعمل بلغة سى.\n" +
                "\n" +
                "دراسة المهمة المطلوبة من الدائرة بدقة, و معرفة المطلوب بكل تفاصيله لتنفيذه بشكل صحيح.\n" +
                "\n" +
                "التركيز الشديد و التجربة الجيدة, ففى الEmbedded Systems ليس مسموحا بالأخطاء أو الbugs, يجب ان يعمل هذا النظام لسنوات دون توقف",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/embeded.jpg?alt=media&token=76eded58-fbd9-45e7-888c-073fad3db46a"));
        list.add(new category_class("cv", R.mipmap.cv, "Cv & Resume", "حتاج البحث عن وظيفة إلى العديد من الخطوات اهمها إنشاء سيرة ذاتية CV محدثة، وعلى الباحث عن وظيفة أو أي محترف أن تكون لديه سيرة ذاتية CV محدثة جاهزة باستمرار، لأن الفرص احيانا تكون محدودة وتتطلب السرعة، لكن إنشاء سيرة ذاتية CV ليس أمرا سهلا بالنسبة للكثيرين خصوصا عند كتابتها للمرة الأولى.\n" +
                "\n" +
                "لكن توجد على الإنترنت العديد من المواقع المفيدة التي تتيح إنشاء سيرة ذاتية CV بسهولة، كما توفر بعضها العديد من الخيارات الخاصة بالتصميم للحصول على سيرة ذاتية تناسب المهارات، وهي المواقع التي توفر الخدمة غالبا مجانا مع إمكانية الحصول على خيارات أكثر مقابل خدمة مدفوعة.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/cv.jpg?alt=media&token=a6983dd5-578f-4cd8-aa24-ac009ddc39f1"));
        list.add(new category_class("jobs", R.mipmap.jobs, "Jobs", "Preparing For a Job Interview\n" +
                "\n" +
                "level 1 :\n" +
                "https://app.pluralsight.com/library/courses/developer-job-interviews/table-of-contents\n" +
                "____________________________________\n" +
                "لينكات زظائف جوجل وشركات اخرى...\n" +
                "\n" +
                "1-https://egypt.tanqeeb.com/ar/?fbclid=IwAR1ehKSgGxKDelBt6K7g1ARXH64xqW7nRjLMnw4Rzi56lAaZSgSnOBrIpFg\n" +
                "2-https://careers.google.com/jobs/results/?company=Google&company=YouTube&employment_type=FULL_TIME&jlo=&q=soft&sort_by=relevance\n" +
                "3- https://wuzzuf.net/a/Android-Mobile-Development-Jobs-in-Egypt\n" +
                "4-http://androidweekly.net/", "" +
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/job.jpg?alt=media&token=9bec989a-4298-4779-9f73-6617a63f14cb"));
        list.add(new category_class("design", R.mipmap.design, "Design", "فن التصميم يعتبر فن التصميم أحد أنواع الفنون التشكيلية، حيث يتم استثمار بعض عناصر العمل في الأعمال الفنية من هذا النوع من الفنون، مثل الفراغ، واللون، والكتلة، ويتم تجاهل عدد من العناصر الأخرى، وذلك من أجل تحقيق الأهداف التي يطمح ذلك الفن للوصول إليها.[١] ويُقصد بالتصميم صُنع الأشياء الجميلة والابتكارات التشكيلية، ويمكن أن يصدر التصميم عن عملية تخطيط متكاملة لشكل ما، وإنشائه بشكل مُرضٍ من ناحية الوظيفة والمشاعر التي يجلبها ذلك التصميم من السعادة النفسية، ويجب أن يُدرك الإنسان أن التصميم يحتاج إلى خطة كاملة من أجل تشكيل التصميم أو تركيبه، لأنه عمل يساعد على تحقيق الوظيفة والغرض المخصص له. ويُقصد بالتصميم أيضاً عمليات الابتكار التي تساعد على استخدام أفكار جديدة، تساعد على إعطاء بهجة للحياة، ويمكن أن يُعرَّف بأنه خطة منظمة ومتكاملة تساعد على حل مشكلة ما وتنظيم العلاقات لتحقيق هدف معيّن.[٢] أنواع فن التصميم يعتبر فن التصميم من الفنون الجماهيرية التي تشتمل على ثلاثة أنواع مختلفة، وتتمثل تلك الأنواع بما يأتي:[١] التصميم الفني: ويظهر في العديد من الأمور مثل أغلفة الكُتب، والملصقات السياسية، وبطاقات التهنئة. التصميم الصناعي: ويظهر في عدة أمور ومنها، تصميم الأثاث، وتصميم الأجهزة الكهربائية، وتصميم المنازل. التصميم الإعلامي: ويظهر هذا النوع من التصميم في المجالات التجارية، والسياحية، وفي الإشارات التحذيرية مثل إشارات المرور. مجالات فن التصميم تمتد المجالات الخاصة بفن التصميم إلى عدد من الأفرُع المختلفة ومنها، الرسم، والرسوم المتحركة، كما أن التصميم الجرافيكي هو أحد فروع هذا الفن، كما أن عالم الهندسة والبناء يتشارك في هذا النوع من الفنون، وخاصة مهندسي التصميم الميكانيكي، والهندسة المعمارية، ومصممي المناظر الطبيعية،[٣] ومن أبرز تلك الأفرُع ما يأتي: التصميم الجرافيكي يُعرف التصميم الجرافيكي بأنه مهنة تساعد على تصميم الأشكال، سواء كانت تلك الأشكال إلكترونية أو مطبوعة، مثل الأشكال التي تظهر في الإعلانات ومواقع الإنترنت،[٤] كما يُعرف هذا المجال من التصميم بأنه الفن الذي يساعد على ترتيب العناصر البصرية التي تتمثل في الألوان، والرموز، والصور، من أجل نقلها إلى الجمهور، ويجمع التصميم الجرافيكي بين عنصرين هما: العناصر اللفظية والعناصر المرئية، وذلك من أجل أن يكون التصميم فعّالاً، وقد ارتبط هذا النوع من التصميم بالممارسات المهنية التي ترتبط مع الخيال البصري، ومتطلبات المجتمع، والابتكارات التكنولوجية بشكل وثيق، وقد استُخدم التصميم الجرافيكي في التاريخ القديم، مثل استخدامه في المخطوطات الخاصة بكل من مصر، والصين، واليونان، كما وظهر هذا النوع من التصميم في كتب القرن الخامس عشر.[٥] وقد أصبح التصميم الجرافيكي مهنة في الغرب في القرن التاسع عشر الميلادي، وذلك بسبب ظهور الإمكانيات التجارية التي ظهرت مع وجود الثورة الصناعية، بالإضافة لوجود تكنولوجيا جديدة، وقد تقدمت التكنولوجيا الخاصة بمصممي الجرافيك طوال فترة القرن العشرين ميلادية، حيث توسعت هذه المهنة فأصبحت تظهر على المُلصقات، وصفحات المجلات، والعلامات التجارية، والإعلانات، والصور المتحركة، واللافتات.[٥] التصميم الداخلي يُعرف التصميم الداخلي بأنه التصميم والتخطيط الخاص بالمساحات، ويتم من صُنع البشر، ويعتبر هذا التصميم جزءاً من التصميم البيئي الذي يرتبط ارتباطاً وثيقاً بالتصميم المعماري، وقد كان هذا النوع من التصميم لا يحمل معنى تقريباً في الفترة الواقعة في منتصف القرن العشرين الميلادي إلى أن تم استخدمه كمهنة حقيقية في عدد من البلاد في أوروبا، وقد عُرف هذا النوع من التصميم باسم الهندسة الداخلية، حيث يُعتبر التصميم الداخلي أحد الفروع المُتخصصة من الهندسة المعمارية، وهناك عدد من العوامل التي تساعد على جعل المباني أفضل من ناحية التصميم الداخلي، ويكون ذلك من خلال وجود عدة عوامل منها: الموقع، والمناظر الطبيعية، والأثاث، والجانب الهيكلي للمبنى، والرسومات المعمارية.[٦] ويعمل المصمم الداخلي في المتاجر الصغيرة أو الكبيرة، وفي الأستديوهات، ويتم عمله من خلال حدوث مشاورات بينه وبين عملائه، أو بين العمّال أو بين المصنعين، ويمكن أن يتطلب عمل المصمم الداخلي السفر لمسافات طويلة، والعمل لساعات غير منتظمة وطويلة، أو زيارة المنازل أو المباني التي لازالت قيد الإنشاء، كما يحتاج هذا النوع من العمل إلى المرونة، والدبلوماسية، والصبر، مع وجود الحسّ الإبداعي والتجاري، كما ويجب أن يمتلك المصمم الداخلي المهارات الخاصة في العمل على الحاسوب، وذلك من أجل أن يتمكن من عرض التصاميم الخاصة به إلكترونياً، بالإضافة إلى وجود القدرة على حلّ المشاكل التي تعترض العمل.[٧] الرسم يعتبر الرسم من الفنون التي تساعد على إنتاج الصور على الأسطح، ويكون ذلك من خلال استخدام الطباشير العادية، والطباشير الملونة، والجرافيت، والفحم، والحبر،[٨] ويعبر فن الرسم عن المشاعر والأفكار، بالإضافة إلى أنه يُعبر عن خلق الصور الجمالية ذات الأبعاد الثنائية باستخدام اللغة البصرية، ويُعبر عن الرسم بطرق وأشكال، وخطوط، وألوان مختلفة، وينتج عنها حركة، وضوء، وأحجام على أسطح مستوية، وتُدمج فيها العناصر بشكل معبر، من أجل إنتاج الظواهر الخارقة للطبيعة، أو الظواهر الطبيعية، ويكون ذلك من أجل إظهار العلاقات المرئية المجرّدة بشكل كامل، ويقوم الرسام باختيار شكل الرسمة سواء كانت لوحة أو جداريه، أو أي شكل من الأشكال الحديثة المتنوعة، مع استخدام الرسام أسلوبه الخاص من أجل أن يحقق من خلالها صورته المرئية الفريدة من نوعها.[٩]\n" +
                "\n" +
                "إقرأ المزيد على موضوع.كوم: https://mawdoo3.com/%D9%85%D8%A7_%D9%87%D9%88_%D9%81%D9%86_%D8%A7%D9%84%D8%AA%D8%B5%D9%85%D9%8A%D9%85",
                "https://firebasestorage.googleapis.com/v0/b/signin-signup-ui-design-43047.appspot.com/o/design.jpg?alt=media&token=1c941ee4-6aee-44f7-b2dd-29b347d7fa81"));
        list.add(new category_class("interviewTips", R.mipmap.interview, "InterViews", "Top 10 Interview Tips\n" +
                "We've all heard about someone's nightmare interview experience. Perhaps you've even had one yourself. We've provided our top 10 interview tips to help you avoid an interview nightmare of your own, 1) Research the Company you are applying to thoroughly. You will undoubtedly be asked ‘why are you applying to this Company’, ‘why this sector’ or a variant of that question. Make sure you are up to date with the latest developments e.g. Company news and industry news.\n" +
                "\n" +
                "2) Use STAR to answer questions when you are asked to ‘give an example of a time when’. STAR stands for:\n" +
                "\n" +
                "Situation e.g. where were you (at University, at work).\n" +
                "\n" +
                "Task e.g. what were you doing (leading a project, part of a team).\n" +
                "\n" +
                "Action e.g. what did you do (have a difficult team member you had to motivate, change an approach in order to achieve a difficult target).\n" +
                "\n" +
                "Result e.g. what was the outcome of your actions (did you achieve your goal, did you keep a customer happy, did you outperform others).\n" +
                "\n" +
                "3) Practise answering interview questions, clearly and concisely using good examples. It’s worth investing in interview coaching, the job market is incredibly competitive at the moment Interview Gold offer interview coaching covering a wide range of sectors including Accounting, Banking, Law, Consulting and Sales. Find out more below:\n" +
                "\n" +
                "4) Review your CV thoroughly; this is often the starting point of any interview. Make sure you know what’s written on your CV and it’s a concise easy to read document, a good length at graduate level would be two pages. You can get a free CV review from the CV centre:\n" +
                "\n" +
                "5) Ensure you have good examples of a time when you have been a member of a team, a leader, dealt with a difficult person etc. These are all key workplace skills and you should ensure you have a couple of good examples of each skill.\n" +
                "\n" +
                "6) Arrive early. Aim to arrive at least 10 minutes early this shows you are punctual and reduces the risk of arriving late. If in there waiting room there is any Company literature pick that up and have read, this will make it look like you’re interested in the Company and gives a better impression that sitting there on your phone.\n" +
                "\n" +
                "7) Dress smartly. It’s better to overdress than underdress. Ideally you should aim to dress like the people who will be interviewing you so if they are going to be wearing a suit and tie you should wear one too. Make sure you polish your shoes too.\n" +
                "\n" +
                "8) Have a couple of questions to ready to ask at the end. Interviewers will almost certainly ask if you have any questions at the end. Interviews are a two way process and if you have some good questions this will impress the interviewer.\n" +
                "\n" +
                "9) Be prepared to talk about your interests outside work. You’ll probably be working with the person interviewing you so they’ll want to know what sort of person you are and what you’re interested in. People forget about this when preparing for their interview.\n" +
                "\n" +
                "10) Don’t forget about the psychometric tests! Many assessment centres require candidates to re take their numerical and verbal reasoning tests it could be week in-between passing your psychometric test and being invited to attend an assessment centre. Keep practicing that’s the best way to improve your performance. Become a member of practice aptitude tests today and get access to hundreds of practice questions all with worked solutions.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/interviewtips.jpg?alt=media&token=e18b621e-3c3d-497e-9ade-7e51cfc13610"));
        list.add(new category_class("softskills", R.mipmap.soft, "Soft_Skills", "المهارات الناعمة هي تلك المهارات التي يبحث عنها سوق العمل في الخريجين من البرامج التعليمية المختلفة.\n" +
                "\n" +
                "وبما أن هناك مهارات ناعمة، فبطبيعة الحال هناك مهارات صلبة وتتمثل في المؤهلات والخبرة، وهذه المهارات الصلبة نحتاج منها 15% بينما المهارات الناعمة نحتاج منها 85%، وسنتطرق للمهارات الناعمة لأهميتها في الوقت الحالي.\n" +
                "\n" +
                "1-   تعريف المهارات الناعمة\n" +
                "تُعرّف المهارات الناعمة بأنها:\n" +
                "\n" +
                "المهارات والقدرات التي يمتلكها الفرد وتساهم في تطوير ونجاح المؤسسة التي ينتمي لها، خاصة المؤسسات التي تتعامل مع الجمهور وجها لوجه. وتتعلق هذه المهارات بالتعامل الفعّال وتكوين العلاقات مع الآخرين – مهارات التواصل :\n" +
                "و تعني التعامل مع القياديين والزملاء في العمل بلطف وكذلك التعامل مع الجمهور (المستفيدين) بحسن و لباقة.\n" +
                "\n" +
                "وتتمثل في القدرة على التحدث بطلاقة – مهارة الإصغاء والاستماع – القدرة على إعطاء تغذية راجعة – تكوين علاقات اجتماعية ناجحة – القدرة على تحفيز الآخرين.\n" +
                "\n" +
                "– مهارات التنظيم والتخطيط:\n" +
                "وهي القدرة على تحديد الأولويات والبداية بالأهم ثم المهم، والقدرة على تخطيط وإدارة الوقت والمهام.\n" +
                "\n" +
                "وتتمثل في ترتيب الأولويات – إدارة الوقت – الالتزام بالمواعيد – اتخاذ القرارات المناسبة.\n" +
                "\n" +
                "– مهارات العمل ضمن فريق:\n" +
                "وهي القدرة على إدارة وتمثيل المجموعة في العمل، والقدرة على تنفيذ الأدوار بفعالية.– مهارات التأقلم والمرونة:\n" +
                "وهي قدرة الفرد على استيعاب متطلبات بيئة العمل والتكيف معها.\n" +
                "– مهارات التفكير الناقد:\n" +
                "وهي قدرة الفرد على إصدار الأحكام على الأعمال، واستنتاج الحلول والأفكار الخلاقة.\n" +
                "\n" +
                "وتتمثل في العمل تحت الضغط – العمل في بيئات متنوعة ثقافياً – اتساع الأفق – تقبل النقد.\n" +
                "\n" +
                "\n" +
                "وتتمثل في القدرة على توليد الأفكار – التفكير خارج الصندوق – النقد البناء.\n" +
                "\n" +
                "– مهارات إدارة الأزمات:\n" +
                "وهي القدرة على حسن التصرف وإيجاد الحلول المناسبة للمشكلات وتوقع المخاطر والإشكاليات.\n" +
                "\n" +
                "وتتمثل في مهارة حل المشكلات – التعامل مع المواقف الصعبة – التنبؤ بسلوك الآخرين.\n" +
                "\n" +
                "– مهارات الاحتراف:\n" +
                "وهي قدرة الفرد على الاستفادة من تطور التكنولوجيا واستخدامها في بيئة العمل بكفاءة عالية.– مهارات التفاوض:\n" +
                "وهي قدرة الفرد على عرض وتسويق الأفكار والمشاريع بصورة مقبولة لدى المستفيدين.\n" +
                "\n" +
                "وتتمثل في القدرة على التفاوض – القدرة على الإقناع – مهارة العرض والتقديم.\n" +
                "\n" +
                "هكذا وبعد عرض أبرز المهارات الناعمة، ينبغي على الباحثين عن فرص للعمل في ظل التحديات والمنافسة، أن يعملوا على تطوير المهارات المكتسبة، و السعي لتعلم مهارات جديدة من خلال البرامج والدورات التدريبية، والاطلاع والقراءة في جوانب تنمية المهارات الناعمة وصقلها وعدم الاعتماد على المهارات الصلبة فقط.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/softskills.png?alt=media&token=83641c28-34f7-49c0-b1f4-2207d2d39ad8"));

        list.add(new category_class("lang", R.mipmap.lang, "Languages", "3 لغات توفر لك فرص فى الدراسة والعمل اللغة الإنجليزية هى الأهم بين غيرها من اللغات فهى أول لغة فى العالم، ولكن ماذا عن اللغات الأخرى التى يجب عليك تعلمها من أجل الحصول على فرص مهمة سواء فى تعلمك أو وظائفك المستقلية، هذا ما نقدمه لك عن 3 لغات هم الايطالية والألمانية والفرنسية." +
                "\n" +
                "اللغة الفرنسية\n" +
                "تعد اللغة الفرنسية مهمة جدا للتعلم بسبب كونها اللغة الرسمية فى 29 دولة كما أنها اللغة الاجنبية الرئيسية لدول المغرب العربى مثل الجزائر والمغرب وتونس، وذلك بجانب لغتهم العربية، فحوالى 129 مليون شخــص يتحدثون اللغة الفرنسية كلغة أساسية بجانب اللغة الأصلية، وهو ما يجعلها مهمة فى الدراسة لأنها تؤهلك لوظائف فى المجال الدبلوماسى سواء فى القارة الأفريقية أو الأوروبية أو الولايات المتحدة الأمريكية، كما أن إجادتها توفر لك أيضا فرص هائلة فى القطاع السياحى.اللغة الإيطالية\n" +
                "تحتل اللغة الإيطالية المرتبة الخامسة فى العالم فى مجال الدراسة والثالثة بالنسبة للتحدث، وهو ما يشير إلى مدى أهمية تعلمها خاصة أن هناك جامعات دولية مختلفة لديها أقســام لتدريسها على أنها لغة أساسية، أما عن سوق العمل فأنها يتطلبها بشدة لقلة الاقبال عليها بين الشباب خاصة فى الوطن العربى ومن ثم قلة المتخصصين بها، ما يجعل فرص العمل أوفر لمن يجيدون التعامل بها، خاصة فى مجال الترجمة.اللغة الألمانية\n" +
                "هذه اللغة على الرغم من كونها غير مرنة وراقية مثل الفرنسية والإيطالية، إلا أنها مهمة جدا فى حالة الحاجة إلى العمل فى الشركات الألمانية المميزة فى بعض التخصصات عن غيرها من الشركات، ما يجعل تعلمها مرتبط بمجال دراستك، فإذا كنت تهدف إلى التخصص فى مجال صناعة السيارات وتقنياتها فلا تنسى أبدا أن الدراسة بالألمانى ستكون الأفضل على الإطلاق لكى تؤهل للعمل فى شركات ألمانية لأنها تعتز جدا بلغتها الوطنية فى التعامل أكثر من أى لغة أخرى سواء كانت الإنجليزية أو غيرها، كما أن تعلم اللغة الألمانية أمر جيد على نطاق أخر كفرص وظائف الترجمة سواء كانت فورية لمتحدثين فى مؤتمرات صحفية وسياسية أو لكتب ومجلات متخصصة تكتب بهذه اللغة.",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/anguages.jpg?alt=media&token=aeafcb02-54a8-42bb-803c-cb4fae601676"));
        list.add(new category_class("progrmmingbasics", R.mipmap.pro, "programing", "لغات البرمجة تمكننا من التواصل مع الحاسوب عبر إعطائه توجيهات وتعليمات يمكن أن يفهمها وينفّذها، لغات البرمجة مثلها مثل اللغات البشرية لها قواعد صارمة يجب اتباعها والتقيد بها، يُقدر أنّ هناك ما بين 500 إلى 2000 لغة برمجة نشطة تستخدم للأغراض العامة طبقًا لبعض الإحصاءات، وهو عدد كبير جدا، لكن أغلبية المبرمجين في العالم لا يستخدمون سوى بضع عشرات منها فقط.\n" +
                "\n" +
                "\n" +
                "الحاسوب لا يفهم لغات البرمجة بشكل مباشر، فهو لا يفهم إلا لغة واحدة، وهي اللغة الثنائية (binary)، والتي تتكون من تتابع للقيمتين 1 و 0 (ومن هنا تأتي التسمية)، لذلك عادة ما تتم ترجمة لغات البرمجة إلى اللغة الثنائية عبر برنامج يُسمى المُترجم (compiler) قبل أن يقوم الحاسوب بتنفيذها بدأ أساسيات البرمجة من الكود البرمجي -أو الشيفرة البرمجية كما يسميها البعض- وهي مجموعة التعليمات المكتوبة باستخدام لغة برمجة معينة، هذه الأكواد هي عبارة عن تعليمات يقوم الحاسوب بتنفيذها بالتتابع، هذه التعليمات قد تكون قراءة محتوى ملف مثلا، أو رسم شكل ما، أو القيام بعملية حسابية.\n" +
                "\n" +
                "هذا مثال على برنامج صغير مكتوب بلغة البرمجة C يقوم بعرض جملة “السلام عليكم” على الشاشة:\n" +
                "\n" +
                "#include\n" +
                "\n" +
                "int main() {\n" +
                "\n" +
                "printf(\"السلام عليكم\");\n" +
                "\n" +
                "return 0;\n" +
                "\n" +
                "}إتقان مفاهيم و أساسيات البرمجة تلك مثل:\n" +
                "\n" +
                "الثوابت:\n" +
                "وهي القيم الثابتة التي يتم تعريفها بادئ الأمر، ولا تتغير لاحقًا في أي مرحلة من مراحل تنفيذ البرنامج كالثوابت الرياضية على سبيل المثال.\n" +
                "\n" +
                "المتغيرات:\n" +
                "عكس الثوابت؛ فهي قيم قابلة لتغيير قيمتها في الذاكرة وقتما تكون هناك حاجة لذلك ضمن آلية عمل البرنامج.\n" +
                "\n" +
                "الجمل الشرطية:\n" +
                "وهو اشتراط تحقُّق شرط محدد ليتم تنفيذ المطلوب كقاعدة If-Then التي تشترط حدوث ما بعد (If) ليتم تحقيق ما بعد Then.\n" +
                "\n" +
                "الدوال:\n" +
                "هي مجموعة أوامر أشبه ببرنامج صغير يقوم بمهمة واحدة فقط.\n" +
                "\n" +
                "الحلقات التكرارية:\n" +
                "برمجية هدفها تنفيذ أجزاء محددة من الكود البرمجي عدة مرات محددًا لها متى تبدأ وتنتهي، وعدد مرات التكرار.أهمية تعلم البرمجة البرمجة هي إحدى المهارات المطلوبة في سوق العمل، والتي تحقق دخلا محترما للمبرمجين، ففي الولايات المتحدة مثلا، يبلغ متوسط دخل المبرمجين أكثر من 70 ألف دولار سنويا، وهو مبلغ كبير مقارنة بباقي المجالات.\n" +
                "تعطيك حرية أكبر في العمل، فيمكنك أن تعمل من أي مكان شئت، من منزلك، أو من المكتب، أو أي مكان في العالم، كل ما تحتاجه هو حاسوب فقط.\n" +
                "بعض مجالات البرمجة ذات أهمية بالغة في المجالات المتقدمة، مثل الذكاء الاصطناعي، والتشفير والعملات الرقمية وغيرها من القطاعات الواعدة.\n" +
                "تعلم أساسيات البرمجة وصولًا لاحترافها لا يحتاج منك الكثير من الوقت مقارنة بالمهن الأخرى، فمثلا لكي تصبح مهندسا فستحتاج إلى خمس سنوات من الدراسة، في المقابل لن يحتاج منك تعلم أساسيات البرمجة إلا بضعة أشهر، ولن يأخذ منك التعمق في البرمجة واحترافها إلا سنة واحدة أو سنتين كأقصى حد.\n" +
                "يمكنك بدء رحلتك في تعلم أساسيات البرمجة وحتى إتقانها وحدك، فهناك آلاف الكتب والدروس والفيديوهات التعليمية المجانية على الانترنت.\n" +
                "لا تحتاج إلى شهادة علمية من أجل تعلم البرمجة، فالكثير من المبرمجين المحترفين لم يذهبوا إلى الجامعة، ولم يحصلوا على أي شهادات علمية، ومع ذلك استطاعوا شق طريقهم في عالم البرمجة.مجالات استخدام لغات البرمجة\n" +
                "تطوير المواقع وبناء التطبيقات تطوير تطبيقات الويندوز\n" +
                "ويندوز هو نظام التشغيل الأكثر انتشارا في العالم، حيث أنّ 90% من الحواسيب تشتغل على هذا النظام، هناك الكثير من لغات البرمجة التي تجعل من تطوير برامج للعمل على هذا النظام أمرا سهلا، ومن أشهرها C و C++\u200E و R و python وغيرها الكثير.\n" +
                "\n" +
                "تطوير الألعاب\n" +
                "هل سبق ولعبت لعبة ثم تمنّيت لو أنك تصنع لعبة مثلها؟ صار هذا ممكنا اليوم مع التطور الكبير في لغات البرمجة التي جعلت تطوير الألعاب ممكنا للأفراد بعد أن كانت حكرا على الاستوديوهات الكبيرة، فمعظم لغات البرمجة الشهيرة صارت توفر مكتبات وأدوات تسهل كثيرًا عملية تطوير الألعاب.\n" +
                "\n" +
                "فلغة بايثون مثلا توفر المكتبة pygame لتسهل على المبرمجين تطوير الألعاب، أما لغة C فتوفر المكتبة raylib من بين بدائل كثيرة.\n" +
                "\n" +
                "أيضا ظهرت في السنوات الأخيرة برامج متخصصة في تطوير الألعاب، هذه البرامج تُسمى محركات الألعاب، وهي مزودة بكل ما تحتاجه لتطوير أي لعبة تتخيلها، ومن أشهر هذه المحركات نجد Unity3D و Unreal وغيرهما كثير.\n" +
                "\n" +
                "تطوير تطبيقات الموبايل\n" +
                "برمجة تطبيقات الموبايل تختلف عن بناء المواقع، لأنها تتطلب تعلم تقنيات إضافية خصوصا مع وجود منصتين مختلفتين، وهما منصتي أندرويد، و ios، وكل منهما تحتاج إلى لغات برمجة خاصة بها، فأندرويد يحتاج إلى تعلم الجافا (Java) أو كوتلن (Kotlin)، أما ios فيحتاج إلى تعلم بيئة العمل iOS SDK.\n" +
                "\n" +
                "لحسن الحظ ظهرت مؤخرا تقنيات جديدة يمكن أن تسهل برمجة تطبيقات الأندرويد، وبرمجة تطبيقات ios، حيث تعتمد هذه التقنيات على لغات الويب، وهي لغات البرمجة المستخدمة في بناء المواقع (HTML و CSS و javascript)، ما يعني أنك لن تكون محتاجا إلى تعلم تقنيات جديدة، فكل ما عليك تعلمه هو تقنيات الويب، ويمكنك استخدامها لبناء التطبيقات كذلك، من أفضل الأدوات التي تساعد على هذا نجد كوردوفا (Cordova) و يونيك (ionic).",
                "https://firebasestorage.googleapis.com/v0/b/guideme-72974.appspot.com/o/program.jpg?alt=media&token=c7067794-7fbf-47bf-8415-ae9e6ebfe8bf"));

        recyclerView = findViewById(R.id.rv);
        adapter = new categ_adapter(list);
        gridLayoutManager = new GridLayoutManager(this, 2);
        recyclerView.setHasFixedSize(true);
        recyclerView.setLayoutManager(gridLayoutManager);
        recyclerView.setAdapter(adapter);


    }


    @Override
    protected void onStart() {
        super.onStart();

        if (firebaseAuth.getCurrentUser() != null) {
            String current_user_id = firebaseAuth.getCurrentUser().getUid();
            FirebaseUser currentUser = FirebaseAuth.getInstance().getCurrentUser();
            if (currentUser != null) {
                firebaseFirestore.collection("users").document(current_user_id).get().addOnCompleteListener(
                        new OnCompleteListener<DocumentSnapshot>() {
                            @Override
                            public void onComplete(@NonNull Task<DocumentSnapshot> task) {
                                if (task.isSuccessful()) {
                                    if (!task.getResult().exists()) {
                                        Intent intent = new Intent(getApplicationContext(), upload_user_image.class);
                                        startActivity(intent);
                                    }
                                }
                            }
                        }
                );
            }
        }else{
            Intent intent = new Intent(getApplicationContext(), MainActivity.class);
            startActivity(intent);
            finish();
        }




    }
 }